In [4]:
import pandas as pd

In [6]:
ser = pd.Series(data = [100,200,300,400,500], index = ['tom','jen','ret','bob','fru'])
print(ser)

tom    100
jen    200
ret    300
bob    400
fru    500
dtype: int64

In [7]:
ser.index

Index(['tom', 'jen', 'ret', 'bob', 'fru'], dtype='object')

In [13]:
ser[['jen','ret']]

jen    200
ret    300
dtype: int64

In [14]:
ser[[4,2,3]]

fru    500
ret    300
bob    400
dtype: int64

In [16]:
#to check if an index exists in a series
'tom' in ser

True

In [17]:
ser[['jen','bob']] **2

jen     40000
bob    160000
dtype: int64

## create dataframe from dictionary of python series

In [18]:
d = {'one':pd.Series([100.,200.,300.],index=['apple','dog','rex']), 
     'two':pd.Series([111.,222.,333.,4444.],index=['appple','baallr','udty','opel'])}

In [24]:
df = pd.DataFrame(d)
df
#print(df)

          one     two
apple   100.0     NaN
appple    NaN   111.0
baallr    NaN   222.0
dog     200.0     NaN
opel      NaN  4444.0
rex     300.0     NaN
udty      NaN   333.0

In [20]:
df.index

Index(['apple', 'appple', 'baallr', 'dog', 'opel', 'rex', 'udty'], dtype='object')

In [21]:
df.shape

(7, 2)

In [22]:
df.columns

Index(['one', 'two'], dtype='object')

In [25]:
#selecting some index numbers
pd.DataFrame(d, index=['dog','opel','udty'])

        one     two
dog   200.0     NaN
opel    NaN  4444.0
udty    NaN   333.0

In [26]:
pd.DataFrame(d, index=['dog','opel','udty'], columns = ['one','six'])

        one  six
dog   200.0  NaN
opel    NaN  NaN
udty    NaN  NaN

## create dataframe from list of pyhton dictionary

In [32]:
dat = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20}]
#print(dat[0])
pd.DataFrame(dat)

   alex  alice  dora  ema  joe
0   1.0    NaN   NaN  NaN  2.0
1   NaN   20.0  10.0  5.0  NaN

In [33]:
pd.DataFrame(dat, columns = ['alex','dora','alice'])

   alex  dora  alice
0   1.0   NaN    NaN
1   NaN  10.0   20.0

## basic dataframe operations

In [34]:
df

          one     two
apple   100.0     NaN
appple    NaN   111.0
baallr    NaN   222.0
dog     200.0     NaN
opel      NaN  4444.0
rex     300.0     NaN
udty      NaN   333.0

In [35]:
df['one']

apple     100.0
appple      NaN
baallr      NaN
dog       200.0
opel        NaN
rex       300.0
udty        NaN
Name: one, dtype: float64

In [38]:
df['three'] = df['one'] + df['two']
df['three']

apple    NaN
appple   NaN
baallr   NaN
dog      NaN
opel     NaN
rex      NaN
udty     NaN
Name: three, dtype: float64

## Data VIsualisation

In [ ]:
%matplotlib inline
r